In [2]:
import pandas as pd

data = {
    "name": ["Alice", "Bob", "Charlie", "Dana", "Eve"],
    "age": [24, 30, 29, 35, 22],
    "city": ["Seattle", "Tacoma", "Bremerton", "Seattle", "Tacoma"],
    "score": [88, 92, 95, 70, 85],
}

df = pd.DataFrame(data)
df

      name  age       city  score
0    Alice   24    Seattle     88
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70
4      Eve   22     Tacoma     85

In [2]:
df.head()      # first 5 rows
df.info()      # column types + missing data
df.describe()  # numerical summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
 3   score   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

             age      score
count   5.000000   5.000000
mean   28.000000  86.000000
std     5.147815   9.721111
min    22.000000  70.000000
25%    24.000000  85.000000
50%    29.000000  88.000000
75%    30.000000  92.000000
max    35.000000  95.000000

In [3]:
df["name"]               # a Series
df[["name", "city"]]     # a DataFrame

      name       city
0    Alice    Seattle
1      Bob     Tacoma
2  Charlie  Bremerton
3     Dana    Seattle
4      Eve     Tacoma

In [4]:
df["name"]

0      Alice
1        Bob
2    Charlie
3       Dana
4        Eve
Name: name, dtype: object

In [5]:
df[["name", "city"]]

      name       city
0    Alice    Seattle
1      Bob     Tacoma
2  Charlie  Bremerton
3     Dana    Seattle
4      Eve     Tacoma

In [6]:
df.head()

      name  age       city  score
0    Alice   24    Seattle     88
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70
4      Eve   22     Tacoma     85

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
 3   score   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [8]:
df[df["age"] > 25]            # ages over 25
df[df["city"] == "Seattle"]   # Seattle people

    name  age     city  score
0  Alice   24  Seattle     88
3   Dana   35  Seattle     70

In [9]:
df[df["age"] > 25]

      name  age       city  score
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70

In [3]:
df["is_high_score"] = df["score"] >= 90

In [4]:
df.head()

      name  age       city  score  is_high_score
0    Alice   24    Seattle     88          False
1      Bob   30     Tacoma     92           True
2  Charlie   29  Bremerton     95           True
3     Dana   35    Seattle     70          False
4      Eve   22     Tacoma     85          False

In [5]:
df.sort_values("score", ascending=False)

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton     95           True
1      Bob   30     Tacoma     92           True
0    Alice   24    Seattle     88          False
4      Eve   22     Tacoma     85          False
3     Dana   35    Seattle     70          False

In [6]:
df.head()

      name  age       city  score  is_high_score
0    Alice   24    Seattle     88          False
1      Bob   30     Tacoma     92           True
2  Charlie   29  Bremerton     95           True
3     Dana   35    Seattle     70          False
4      Eve   22     Tacoma     85          False

In [7]:
df = df.sort_values("score", ascending=False)

In [8]:
df.head()

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton     95           True
1      Bob   30     Tacoma     92           True
0    Alice   24    Seattle     88          False
4      Eve   22     Tacoma     85          False
3     Dana   35    Seattle     70          False

In [9]:
df["is_high_score"].value_counts()

is_high_score
False    3
True     2
Name: count, dtype: int64

In [10]:
df.groupby("city")["score"].mean()

city
Bremerton    95.0
Seattle      79.0
Tacoma       88.5
Name: score, dtype: float64

In [11]:
df.groupby("city")[["age", "score"]].mean()

            age  score
city
Bremerton  29.0   95.0
Seattle    29.5   79.0
Tacoma     26.0   88.5

In [13]:
df.loc[1, "score"] = None

In [14]:
df

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton   95.0           True
1      Bob   30     Tacoma    NaN           True
0    Alice   24    Seattle   88.0          False
4      Eve   22     Tacoma   85.0          False
3     Dana   35    Seattle   70.0          False

In [15]:
df_filled = df.fillna(df["score"].mean())

In [16]:
df

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton   95.0           True
1      Bob   30     Tacoma    NaN           True
0    Alice   24    Seattle   88.0          False
4      Eve   22     Tacoma   85.0          False
3     Dana   35    Seattle   70.0          False

In [17]:
df_dropped = df.dropna()

In [18]:
df

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton   95.0           True
1      Bob   30     Tacoma    NaN           True
0    Alice   24    Seattle   88.0          False
4      Eve   22     Tacoma   85.0          False
3     Dana   35    Seattle   70.0          False

In [19]:
df = df_filled

In [20]:
df

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton   95.0           True
1      Bob   30     Tacoma   84.5           True
0    Alice   24    Seattle   88.0          False
4      Eve   22     Tacoma   85.0          False
3     Dana   35    Seattle   70.0          False

In [21]:
df_dropped

      name  age       city  score  is_high_score
2  Charlie   29  Bremerton   95.0           True
0    Alice   24    Seattle   88.0          False
4      Eve   22     Tacoma   85.0          False
3     Dana   35    Seattle   70.0          False

In [24]:
df_real = pd.read_csv("titanic.csv")

In [25]:
df_real.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True